CPE 434 & 435/Lab_10/schemas-xmlsoap-org_ws_2005_04_discovery(1)

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:pwg="http://www.hp.com/schemas/imaging/con/pwg/sm/1.0" xmlns:dd="http://www.hp.com/schemas/imaging/con/dictionaries/1.0" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"  xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof" xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print" xmlns:wscn="http://schemas.microsoft.com/windows/2006/08/wdp/scan" xmlns:hpd="http://www.hp.com/schemas/imaging/con/discovery/2006/09/19" xmlns:ledm="http://www.hp.com/schemas/imaging/con/ledm/discoverytree/2007/07/01" xmlns:jobcapabilities="http://www.hp.com/schemas/imaging/img/ijc/2007/05/04"><soap:Header><wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action><wsa:MessageID>urn:uuid:92ced610-302d-1f3b-a69d-c01803530bde</wsa:MessageID><wsa:RelatesTo>urn:uuid:daa443cc-8c77-4335-b93b-298e31d8d171</wsa:RelatesTo><wsd:AppSequence InstanceId="38" MessageNumber="348" /></soap:Header><soap:Body><wsd:ProbeMatches><wsd:ProbeMatch><wsa:EndpointReference><wsa:Address>urn:uuid:99b6ec83-ddee-4938-b9c2-c0a496a24b36</wsa:Address></wsa:EndpointReference><wsd:Types>wsdp:Device wprt:PrintDeviceType wscn:ScanDeviceType hpd:hpDevice ledm:hpLEDMDeviceType jobcapabilities:hpJobCapabilitiesDeviceType</wsd:Types><wsd:XAddrs>http://192.168.0.5:3911/ http://[2604:2d80:b404:f000::e0a]:3911/ http://[2604:2d80:b404:f000:c218:3ff:fe53:bde]:3911/ http://[fe80::c218:3ff:fe53:bde]:3911/</wsd:XAddrs><wsd:MetadataVersion>22</wsd:MetadataVersion><hpd:VendorExtension><dd:HardwareAddress>c0:18:03:53:0b:de</dd:HardwareAddress><dd:UUID>urn:uuid:99B6EC83-DDEE-4938-B9C2-C0A496A24B36</dd:UUID><dd:IPv4Address>192.168.0.5</dd:IPv4Address><dd:IPv6Addresses><dd:IPv6Address>fe80::c218:3ff:fe53:bde</dd:IPv6Address><dd:IPv6Address>2604:2d80:b404:f000:c218:3ff:fe53:bde</dd:IPv6Address><dd:IPv6Address>2604:2d80:b404:f000::e0a</dd:IPv6Address></dd:IPv6Addresses><dd:Hostname>NPI530BDE</dd:Hostname><pwg:DeviceId>MFG:HP;MDL:HP LaserJet MFP M139-M142;DES:HP LaserJet MFP M140w;PRN:7MD72A;</pwg:DeviceId><dd:ManageabilityContractID>wsmct:MF;wsmcl:FL;wsmcv:4.0</dd:ManageabilityContractID></hpd:VendorExtension></wsd:ProbeMatch></wsd:ProbeMatches></soap:Body></soap:Envelope>